#
# .zsh_plugins.txt - antidote plugins file
#

#
# Init
#

mattmc3/zephyr path:plugins/environment
mattmc3/zephyr path:plugins/homebrew conditional:is-macos

#
# History
#

mattmc3/zephyr path:plugins/history
larkery/zsh-histdb pre:init_histdb

#
# Completions
#

mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src

#
# Editor
#

mattmc3/zephyr path:plugins/editor
# jeffreytse/zsh-vi-mode
# sorin-ionescu/prezto path:modules/editor
# romkatv/zsh-no-ps2
$ZDOTDIR/lib/zsh-no-ps2.zsh

#
# Prompts
#

# sindresorhus/pure kind:fpath
# miekg/lean kind:fpath
# mattmc3/zephyr path:plugins/prompt
romkatv/powerlevel10k path:powerlevel10k.zsh-theme

#
# Clipboard
#

ohmyzsh/ohmyzsh path:lib/clipboard.zsh
ohmyzsh/ohmyzsh path:plugins/copypath
ohmyzsh/ohmyzsh path:plugins/copybuffer
ohmyzsh/ohmyzsh path:plugins/copyfile

#
# Misc
#

mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/directory
mattmc3/zephyr path:plugins/utility
#mattmc3/zephyr path:plugins/zfunctions

#
# OMZ
#

ohmyzsh/ohmyzsh path:plugins/direnv
ohmyzsh/ohmyzsh path:plugins/extract

#
# Utils
#

romkatv/zsh-bench kind:path
# aloxaf/fzf-tab
mattmc3/zman

#
# macOS
#

mattmc3/zephyr path:plugins/macos conditional:is-macos

#
# Final - zsh-defer for lazy loading heavy plugins
#

romkatv/zsh-defer

# vi: ft=properties
